import React, { useEffect, Fragment } from "react";
import "./CSS/Fatwa.min.css";

const fatwa = {
  title: "আল্লাহ এক, রাসূল এক, ধর্ম এক মাযহাব এত কেন?",
  ques:
    "ছোট্ট একটি প্রশ্ন করি। এক আল্লাহ, এক রাসূল, এক কিবলা, এক ধর্ম। তবে হাদীস প্রনেতা পৃথিবীতে এত কেন? আসলে কি আল্লাহ এই সকল মানুষগুলোকে হাদীস সংগ্রহের দায়িত্ব দিয়েছিলেন? হাদীস সংগ্রহের দায়িত্ব যদি আল্লাহ কাউকে দিতেন, তাহলে একজনকে দিতে পারতেন। তাহলে পৃথিবীতে এত মাযহাব হতো না। এত ফিরকাহ বা মাযহাবের জন্য কি হাদীস প্রনেতারা দায়ী, নাকি আমরা। কিংবা আল্লাহ। কোনটাকে আপনি দায়ী মনে করেন। আমরা যে সব হাদীসগুলো পড়ি এ কথাগুলো কম-বেশী প্রায় সবগুলো কোরআনে আছে। আবার দেখুন অনেক ‍কিছু হাদীসে আছে যা কোরআনে নেই। সেই কারণে কোরআনকে কি আপনি অপূর্ণাঙ্গ কিতাব বলবেন? আল্লাহ বলেছে, কোরআনে সব আছে। যদি কোরআনে সব থেকে থাকে তবে হাদীস আমাদের কি নেয়ার আছে। হাদীস ছাড়া কোরআন কি পূর্ণাঙ্গ কিতাব। যদি হাদীস নিতেই হয়, তাহলে কোরআনের পূর্ণাঙ্গতা কতটা যৌক্তিক?",
  ans:
    "আপনি ছোট বলে অনেক বড় প্রশ্নই করে ফেলেছেন। কেননা, এ প্রশ্নের উত্তর দীর্ঘ হবে। নিম্নে উত্তর প্রদান করা হলো। আশা করি মনযোগ সহকারে উত্তরটি পড়বেন এবং অনুধাবন করবেন। তবে উত্তর প্রদানের পূর্বে একটি বিষয়ে আপনার মনোযোগ আকর্ষণ করা প্রয়োজন। আর তা হলো যে, আপনি প্রশ্নটি করার ক্ষেত্রে নিজের কাছে কোনো উত্তর খুঁজেননি। আমাদের বিশ্বাস আপনি নিজের কাছে জিজ্ঞাসা করলেও এসব প্রশ্নের উত্তর পেয়ে যেতেন। যেমন দেখুন! আপনার প্রশ্ন হলো, ধর্ম এক, আল্লাহ এক, রাসূল এক, তাহলে হাদিস প্রণেতা এত কেন? আপনি বলুন তো! ক্লাস এক, শিক্ষক এক, ছাত্র এত কেন?\nআপনার দ্বিতীয় প্রশ্ন হলো, আল্লাহ তা‘আলা কি এ সব মানুষকে হাদিস সংগ্রহের দায়িত্ব দিয়ে ছিলেন? তার উত্তর হলো, হ্যাঁ, কেননা কোরআন হাদিসের অসংখ্য স্থানে অন্যের নিকট দ্বীন পৌঁছানোর নির্দেশ দেয়া হয়েছে। যেমন, রাসূল স. ইরশাদ করেছেন, يحملهذاالعلممنكلخلفعدوله ‘দ্বীনের এই ইলম প্রত্যেক পরবর্তীদের নিষ্ঠাবানরা বহন করবে।’ (মেশকাতুল আসার:8/373)\nঅন্য হাদিসে ইরশাদ হয়েছে, عن عبد الله بن عمرو، أن النبي صلى الله عليه وسلم، قال: بلغوا عني ولو آية‘আমার পক্ষ থেকে একটি বিষয় হলেও তোমরা অন্যের কাছে পৌঁছিয়ে দাও।’ (বুখারী শরিফ: 1/491)\nমনে রাখতে হবে, এই আদেশের আওতায় হাদিস প্রণেতা, ফিকাহবিদসহ সকল স্তরের মুসলমান এমনকি আপনি, আমিও অন্তর্ভূক্ত। হাদিস সংকলনকারী মুহাদ্দিসগণ অনেক ত্যাগের মাধ্যমে দায়িত্বটি যথাযথভাবে পালন করেছেন। যা তাদের সমগ্র মুসলিম জাতির ওপর এক অসাধারণ কৃপা ও অনুগ্রহ। মুসলমানগণ কোনো দিন তাদের এ ঋণ পরিশোধ করতে পারবে না। একাধিক মাযহাব ও ফিরকার জন্য তাঁরা কোনোভাবেই দায়ী নন। কারণ তাদের দায়ী করতে হলে আগে যিনি হাদিসগুলো বলেছেন, অর্থাৎ রাসূলুল্লাহ স. نعوذباللهতাঁকেই দায়ী করতে হবে। আর শেষ পর্যন্ত نعوذبالله আল্লাহ তা‘আলাকে দায়ী করতে হবে। যা হবে চরম জ্ঞান পাপ ও ধৃষ্টতা। কেননা, এসব কিছুর পেছনে সৃষ্টিকর্তা আল্লাহ তা‘আলার ইচ্ছাই মূল নিয়ামক। আর তাঁর কোনো কাজই অহেতুক ও রহস্য মুক্ত নয়। মানুষ চিন্তা করলে অনেক সময় সে রহস্য বুঝতে সক্ষম হয়। আবার অনেক সময় সক্ষমহয় না। হাদিস সংগ্রহ যদি একজনই করতো, তারপরও মাযহাব এক না হয়ে একাধিক হতো এতে কোনো সন্দেহ নেই। মানুষের বুঝের ভিন্নতা এর বড় কারণ। একই বিষয় একজন এক রকম বুঝলেও অন্যজন অন্য রকম বুঝেন। একই রুগী দুই ডাক্তারের কাছে গেলে দুইজন দুই ধরণের চিকিৎসা করে থাকেন। বুখারী শরিফের একটি হাদিসে এসেছে,\n عن ابن عمر رضي الله عنهما قال : قال رسول الله صلى الله عليه و سلم يوم الأحزاب ( لا يصلين أحد العصرإلا في بني قريظة) فأدرك بعضهم العصر في الطريق فقال بعضهم لا نصلي حتى نأتيها وقال بعضهم بل نصلي لم يرد منا ذلك . فذكر ذلك للنبي صلى الله عليه و سلم فلم يعنف واحدا منهم. \nঅর্থাৎ- নবী করীম স. আহযাবের দিন সাহাবায়ে কেরামের একটি জামাতকে ‘বনী কুরাইজা’ নামক স্থানে এবলে পাঠালেন যে, তোমাদের কেউ যেন বনী কুরাইজায় না পৌঁছা পর্যন্ত আছরের নামায না পড়ে। কিন্তু ঘটনাক্রমে সেখানে পৌঁছতে দেরী হওয়ায় পথিমধ্যে আছরের নামাযের সময় ঘনিয়ে আসে। তখন একদল সাহাবী (রাসূল স. এর আদেশের প্রতি লক্ষ্য করে) বললেন, আমরা বনী কুরাইজাতে পৌঁছার আগে আছরের নামায আদায় করবো না। কিন্তু আরেক দল সাহাবী  (রাসূল স. এর আদেশের উদ্দেশ্যের প্রতি লক্ষ্য করে) বললেন, আমরা আছরের নামায রাস্তায় পড়ে নিব। কেননা, রাসূল স. আমাদের থেকে এই বাহ্যত অর্থ উদ্দেশ্য নেননি। (বরং রাসূলের উদ্দেশ্য হলো, আমরা যেন অতিদ্রুত বনী কুরাইজায় যাই এবং আছরের নামায সেখানে গিয়ে পড়ি। কিন্তু আমাদের দূর্বলতা ও অলসতার কারণে পৌঁছতে দেরী হয়ে যায়। তাই আছরের নামায কাযা করবো না) এ ঘটনা রাসূলুল্লাহ স. কে জানানো হলে তিনি কোনো দলকেই ভর্ৎসনা করেননি। (বুখারী শরিফ : 2/591) এখানে আদেশ ও আদেশদাতা একই হওয়া সত্বেও বুঝ ভিন্ন হওয়ায় আদেশ পালনে মতভেদ দেখা দিয়েছে ।\nএত মাযহাবের জন্য আমরা কাউকে দায়ী মনে করি না। আমরা বিশ্বাস করি যে, এমনটি আল্লাহ তা‘আলার ইচ্ছা ছিলো, তাই তা হয়েছে। বলাবাহুল্য যে, এ ভিন্নতার প্রয়োজন ছিলো। কেননা, মানুষকে আল্লাহ তা‘আলার সৃষ্টিগতভাবে সব ক্ষেত্রে ভিন্নতা দিয়ে সৃষ্টি করে অভিন্ন কোনো বিধান চাপিয়ে দেয়া যৌক্তিকতার পরিপন্থী। আর আল্লাহ পাক অন্যায় অযৌক্তিক সব বিষয় থেকে মুক্ত। \nআপনার আর একটি প্রশ্ন হলো, হাদিস সংগ্রহের দায়িত্ব আল্লাহ তা‘আলা একজনকে দিতে পারতেন। এ প্রশ্নের উত্তর অনেকখানি পূর্বের বর্ণনায় এসে গেছে। তারপরও আপনি নিজেও একজন মানুষ। আপনি নিজে অন্যের সীমাবদ্ধতা সম্পর্কে অবগত না হলেও নিজের ব্যাপারে অবশ্যই অবগত রয়েছেন যে, একজন মানুষের মেধা, জ্ঞান ইত্যাদি বিষয়ে তার কি পরিমাণ সীমাবদ্ধতা রয়েছে। সীমাবদ্ধতা দিয়েই আল্লাহ মানুষকে তৈরী করেছেন। তাহলে একজনকে হাদিস সংগ্রহের দায়িত্ব প্রদান করার প্রস্তাব নিতান্তই হাস্যকর। কেননা, তা সম্ভবই নয়। \nআপনার সর্বশেষ প্রশ্ন হলো, হাদিস ছাড়া কোরআন পূর্ণাঙ্গ কি না? উত্তর হলো, কোরআন পূর্ণাঙ্গি একটি কিতাব। হাদিস ছাড়াও কোরআন পূর্ণাঙ্গ। তবে এর অর্থ এই নয় যে, হাদিসের কোনো প্রয়োজন নেই। কেননা, কোরআন হলো মূল আর হাদিস হলো তার ব্যাখ্যা। সুতরাং কোনোটিই অপরটির অপূর্ণতার দলিল বহন করে না। কোরআন অপূর্ণ নয়। তবে কোরআনের সকল বিষয় সকলের বোধগম্য নয়। তাই সম্ভবত এই কোরআনকেألم দ্বারা শুরু করে প্রথমেই এই বার্তা দেয়া হয়েছে যে, এই কোরআনে পরিবেশিত সকল বিষয় সকলের বোধগম্য নয়। এটি কোরআনের অপূর্ণতা নয়; বরং মানুষের জ্ঞানের সীমাবদ্ধতা। আর হাদিসের অনুসরণ মূলত কোরআনেরই অনুসরণ। কেননা, কোরআন শরিফের বিভিন্ন জায়গায় ইরশাদ হয়েছে, يَاأَيُّهَاالَّذِينَآمَنُواأَطِيعُوااللَّهَوَأَطِيعُواالرَّسُولَ ‘তোমরা আল্লাহর অনুসরণ করো এবং রাসূলের অনুসরণ করো।’ (সূরা সূরা নিসা- 59) আর রাসূলের অনুসরণ তাঁর কথা ও কাজের অনুসরণ ব্যতীত সম্ভব নয়। তাঁর কথা ও কাজকেই তো হাদিস বলা হয়। তাই হাদিসের অনুসরণ মানে কোরআনেরই অনুসরণ করা।",
  ref: [
    "বাদায়েউস সানায়ে ১/৬৪৩",
    "ফাতাওয়ায়ে তাতারখানিয়া ২/৩০২",
    "মআল বাহরুর রায়েক ২/১৩২",
    "রদ্দুল মুহতার ২/৫১৩",
    "সুনানে তিরমিযি, হাদিস ১৮৩",
  ],
};

function Fatwa({ match }) {
  useEffect(() => {
    console.log("make api call with id ===>  " + match.params.id);
  }, [match]);
  return (
    <div className="main fatwa">
      <h2>{fatwa.title}</h2>
      <br />
      {fatwa.ques.split("\n").map((para, i) => {
        return (
          <Fragment key={i}>
            <p className="ques">
              {i === 0 && <span>প্রশ্নঃ </span>}
              {para}
            </p>
            <br />
          </Fragment>
        );
      })}
      <br />
      {fatwa.ans.split("\n").map((para, i) => {
        return (
          <Fragment key={i}>
            <p className="ans">
              {i === 0 && <span> উত্তরঃ </span>}
              {para}
            </p>
            <br />
          </Fragment>
        );
      })}
      <br />
      <br />
      <br />
      <p>সূত্র</p>
      <br />
      {fatwa.ref.length > 0 &&
        fatwa.ref.map((ref, i) => (
          <ul key={i}>
            <li>{ref}</li>
          </ul>
        ))}
      <br />
      <br />
      <br />
    </div>
  );
}

export default Fatwa;
