import React, { useEffect, useState } from "react";
import decodeURIComponent from "decode-uri-component";
import { Link } from "react-router-dom";
import "./CSS/SearchResult.min.css";

const data = [
  {
    id: "23541wgtasgaasgaserq432d",
    ques:
      "ইমিটেশনের হাকিকত কী? ইমিটেশনের অলংকার আংটি, চুড়ি, চেইন ইত্যাদি নারীদের জন্য বৈধ বলা হয় এবং নারীরা ব্যাপকভাবে ব্যবহারও করে। অথচ লোহা, পিতল, তামা ইত্যাদি ধাতু দিয়ে তৈরি আংটি পরিধান করা নারীদের জন্যও বৈধ নয়। ইমিটেশনও তো এসকল ধাতু দিয়ে তৈরি। তাহলে আসল ফরকটা কোথায়? ২. এলার্জির জন্য পিতলের তৈরি আংটি ব্যবহার করা জায়েয আছে কি ?",
    ans:
      "ইমিটেশন মূলত তামা, পিতল ও ব্রোঞ্জ ইত্যাদির মিশ্রণে তৈরী এক প্রকারের অলংকার। যার মধ্যে বিভিন্ন কেমিক্যাল প্রক্রিয়াজাত করে সোনালি কালারের প্রলেপ দেওয়া হয়। আর নিরেট লোহা, তামা কিংবা পিতলের আংটি ইত্যাদি মেয়েদের জন্য ব্যবহার করা নিষেধ হলেও এসবের ওপর যদি অন্য কোনো কিছুর  প্রলেপ থাকে তাহলে তা ব্যবহার করা যাবে। সেমতে নারীদের জন্য সোনা-রুপা ছাড়াও সাজ-সজ্জা হিসাবে লোহা, পিতল, তামা, কাচ-হীরা ইত্যাদি ধাতু দ্বারা তৈরী অলংকার পরিধান করা বৈধ । এলার্জির অযুহাতে নিরেট পিতলের আংটি ব্যবহার করা বৈধ নয়। তবে তার উপর যদি রুপার প্রলেপ থাকে তাহলে নারী-পুরুষ উভয়ে ব্যবহার করতে পারবে। আর স্বর্ণের প্রলেপ থাকলে শুধু নারীদের জন্য বৈধ হবে।",
    img: [],
    date: "2020-03-21",
    ref: [
      "আবু দাঊদ-৪/৯০",
      " এ’লাউস সুনান-১৭/৩১২",
      "মুসান্নাফে ইবনে আবী শায়বাহ-৫/১৯৪",
      " হেদায়া-৪/৩৬৭",
      " শামী-৬/৩৫৬",
      " আল-মুহীতুল বুরহানী-৫/৩৪৯",
      " ইমদাদুল ফাতাওয়া-৪/১৩৫; মাহমুদিয়া-১৪/৪২১",
    ],
  },
  {
    id: "23541wgt34523432d",
    ques: "ভ্রু-প্লাক করার বিধান কী?",
    ans:
      "ভ্রু যদি অতিরিক্ত বেশি হয়ে যায় যে দেখতে খারাপ দেখা যায়। তাহলে তা কেটে স্বাভাবিক অবস্থায় রাখা জায়েয আছে। তবে শুধুমাত্র ফ্যাশনের জন্য ভ্রু-প্লাক করা জায়েয নেই ।",
    img: [],
    date: "2020-03-21",
    ref: [
      "আবু দাঊদ-৪/৯০",
      " এ’লাউস সুনান-১৭/৩১২",
      "মুসান্নাফে ইবনে আবী শায়বাহ-৫/১৯৪",
      " হেদায়া-৪/৩৬৭",
      " শামী-৬/৩৫৬",
      " আল-মুহীতুল বুরহানী-৫/৩৪৯",
      " ইমদাদুল ফাতাওয়া-৪/১৩৫; মাহমুদিয়া-১৪/৪২১",
    ],
  },
  {
    id: "125143wgasdgaasgaserq432d",
    ques:
      "যদি কোন স্বামী তার স্ত্রীকে মেসেজের মাধ্যমে বলে ফেলে যে, ‘‘আজ থেকে তুই স্বাধীন” মানে তোর মনে যা চায়, তুই তাই কর। এখানে স্বামীর তালাকের কোন নিয়ত নেই তাহলে এটা কী হতে পারে?",
    ans:
      "স্বামী তার স্ত্রীকে “তুই স্বাধীন” বলার ক্ষেত্রে তালাকের নিয়ত না থাকলে স্ত্রীর উপর কোন তালাক পতিত হবেনা ।",
    img: [],
    date: "2020-03-21",
    ref: ["সহিহ্ বুখারী-৭/৪৩", "হিদায়া-২/৩৭৩", "মাউসূআতুল ফিকহিয়্যাহ-৩৫/১৩৮"],
  },
  {
    id: "afsdhawq3423sgaasgaserq432d",
    ques:
      "হযরতের কাছে আমার জানার বিষয় হলো, যেসব ফরজ নামাযের কাযা পড়া হয় ঐসব নামাযের সুন্নত কিংবা নফলের কাযা আছে ? বিস্তারিত জানিয়ে বাধিত করবেন।",
    ans:
      "সুন্নত এবং নফলের কাযা আদায় করতে হয় না। তবে ফজরের সুন্নত এক্ষেত্রে ব্যতিক্রম। কখনো ফজরের সুন্নত নামায ফরজসহ কাযা হয়ে গেলে ওই দিন সূর্যোদয়ের পর থেকে দ্বিপ্রহরের পূর্বে কাযা পড়লে ফজরের সাথে সুন্নতও আদায় করে নিবে। আর শুধুমাত্র সুন্নত কাযা হয়ে গেলে সূর্যোদয়ের পর থেকে দ্বিপ্রহরের পূর্বে আদায় করে নেওয়া উত্তম ।",
    img: [],
    date: "2020-03-21",
    ref: [
      "বাদায়েউস সানায়ে ১/৬৪৩",
      "ফাতাওয়ায়ে তাতারখানিয়া ২/৩০২",
      "মআল বাহরুর রায়েক ২/১৩২",
      "রদ্দুল মুহতার ২/৫১৩",
      "সুনানে তিরমিযি, হাদিস ১৮৩",
    ],
  },
];

function SearchResult({ location }) {
  const [results, setResults] = useState();
  useEffect(() => {
    setResults(() => {
      let newResult = null;
      if (data.length > 0) {
        newResult = data.map((item) => {
          return (
            <div key={item.ans.substring(0, 10)} className="result">
              <Link to={`/fatwa/${item.id}`} className="ques">
                {item.ques.length < 180
                  ? item.ques
                  : item.ques.substring(0, 180) + "..."}
              </Link>
              <p className="ans">
                {item.ans.length < 180
                  ? item.ans
                  : item.ans.substring(0, 180) + "..."}
              </p>
            </div>
          );
        });
      } else {
        newResult = <p className="noResult">Opps, Nothing matched.</p>;
      }
      return newResult;
    });
  }, []);
  useEffect(() => {
    const query = decodeURIComponent(location.search).replace("?q=", "");
    fetch("http://localhost:8080/search?q=test")
      .then((res) => res.json())
      .then((data) => console.log(data))
      .catch((err) => console.log("Error: " + err));
  }, [location]);
  return (
    <div className="main searchResult">
      {data.length > 0 && (
        <div className="resultInfo">
          <p>{data.length} result found.</p>
        </div>
      )}
      <div className="content">{results}</div>
    </div>
  );
}

export default SearchResult;
